---
kind: other
id: Properties.T:Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleOverrides
source: html/bab1242a-ab86-0f95-2e3f-8dbfac04d34b.htm
---
# DirectContext3DHandleOverrides Properties

Specifies whether the .NET object represents a valid Revit entity.